Revit 2026 API

# IFCRange Constructor

---

Instantiates a default IFCRange object.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCRange()
```
```vb
Public Sub New
```
```cpp
public:
IFCRange()
```
```fsharp
new : unit -> IFCRange
```

The starting and ending value are both set to zero.

#### Reference

IFCRange Class

IFCRange Overload

Autodesk.Revit.DB.IFC Namespace